MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX350F128H.atdf
      <value-group caption="Cache Coherency Setting on a PFM Program Cycle bit" name="CHECON__CHECOH">
         <value caption="Invalidate all data and instruction lines" name="" value="0x1" />
         <value caption="Invalidate all data lines and instruction lines that are not locked" name="" value="0x0" />
      </value-group>
      <value-group caption="Cache Line Index bits" name="CHEACC__CHEIDX">
         <value caption="Select cache line 15 for reading or writing" name="" value="0xf" />
         <value caption="Select cache line 14 for reading or writing" name="" value="0xe" />
         <value caption="Select cache line 13 for reading or writing" name="" value="0xd" />
         <value caption="Select cache line 12 for reading or writing" name="" value="0xc" />
         <value caption="Select cache line 11 for reading or writing" name="" value="0xb" />
         <value caption="Select cache line 10 for reading or writing" name="" value="0xa" />
         <value caption="Select cache line 9 for reading or writing" name="" value="0x9" />
         <value caption="Select cache line 8 for reading or writing" name="" value="0x8" />
         <value caption="Select cache line 7 for reading or writing" name="" value="0x7" />
         <value caption="Select cache line 6 for reading or writing" name="" value="0x6" />
         <value caption="Select cache line 5 for reading or writing" name="" value="0x5" />
         <value caption="Select cache line 4 for reading or writing" name="" value="0x4" />
         <value caption="Select cache line 3 for reading or writing" name="" value="0x3" />
         <value caption="Select cache line 2 for reading or writing" name="" value="0x2" />
         <value caption="Select cache line 1 for reading or writing" name="" value="0x1" />
         <value caption="Select cache line 0 for reading or writing" name="" value="0x0" />
      </value-group>
      <value-group caption="Cache Access Enable bits for registers CHETAG" name="CHEACC__CHEWEN">
         <value caption="The cache line selected by CHEIDX(3:0) is writeable" name="" value="0x1" />
         <value caption="The cache line selected by CHEIDX(3:0) is not writeable" name="" value="0x0" />
      </value-group>
      <value-group caption="Line Type bit" name="CHETAG__LTYPE">
         <value caption="The line caches instruction words" name="" value="0x1" />
         <value caption="The line caches data words" name="" value="0x0" />
      </value-group>
      <value-group caption="Line Lock bit" name="CHETAG__LLOCK">
         <value caption="The line is locked and will not be replaced" name="" value="0x1" />
         <value caption="The line is not locked and can be replaced" name="" value="0x0" />
      </value-group>
      <value-group caption="Line Valid bit" name="CHETAG__LVALID">
         <value caption="The line is valid and is compared to the physical address for hit detection" name="" value="0x1" />
         <value caption="The line is not valid and is not compared to the physical address for hit detection" name="" value="0x0" />
      </value-group>
      <value-group caption="Line TAG Address Boot bit" name="CHETAG__LTAGBOOT">
         <value caption="The line is in the 0x1D000000 (physical) area of memory" name="" value="0x1" />
         <value caption="The line is in the 0x1FC00000 (physical) area of memory" name="" value="0x0" />
      </value-group>
      <value-group caption="Line Mask bits" name="CHEMSK__LMASK">
         <value caption="Enables mask logic to force a match on the corresponding bit position in the LTAG(19:0) bits (CHETAG(23:4)) and the physical address." name="" value="0x1" />
         <value caption="Only writeable for values of CHEIDX(3:0) bits (CHEACC(3:0)) equal to 0x0A and 0x0B. Disables mask logic." name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00751" name="PMP" version="1">
      <register-group name="PMP">
         <register caption="Parallel Port Control Register" name="PMCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Read Strobe Polarity bit" mask="0x00000001" name="RDSP" values="PMCON__RDSP" />
            <bitfield caption="Write Strobe Polarity bit" mask="0x00000002" name="WRSP" values="PMCON__WRSP" />
            <bitfield caption="Chip Select 0 Polarity bit" mask="0x00000008" name="CS1P" values="PMCON__CS1P" />
            <bitfield caption="Chip Select 0 Polarity bit" mask="0x00000010" name="CS2P" values="PMCON__CS2P" />
            <bitfield caption="Address Latch Polarity bit" mask="0x00000020" name="ALP" values="PMCON__ALP" />
            <bitfield caption="Chip Select Function bits" mask="0x000000C0" name="CSF" values="PMCON__CSF" />
            <bitfield caption="Read/Write Strobe Port Enable bit" mask="0x00000100" name="PTRDEN" values="PMCON__PTRDEN" />
            <bitfield caption="Write Enable Strobe Port Enable bit" mask="0x00000200" name="PTWREN" values="PMCON__PTWREN" />
            <bitfield caption="PMP Module TTL Input Buffer Select bit" mask="0x00000400" name="PMPTTL" values="PMCON__PMPTTL" />
            <bitfield caption="Address/Data Multiplexing Selection bits" mask="0x00001800" name="ADRMUX" values="PMCON__ADRMUX" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="PMCON__SIDL" />
            <bitfield caption="Parallel Master Port Enable bit" mask="0x00008000" name="ON" values="PMCON__ON" />
         </register>
         <register caption="Parallel Port Mode Register" name="PMMODE" offset="0x10" rw="RW" size="4">
            <bitfield caption="Data Hold After Read/Write Strobe Wait States bits" mask="0x00000003" name="WAITE" values="PMMODE__WAITE" />
            <bitfield caption="Data Read/Write Strobe Wait States bits" mask="0x0000003C" name="WAITM" values="PMMODE__WAITM" />
            <bitfield caption="Data Setup to Read/Write Strobe Wait States bits" mask="0x000000C0" name="WAITB" values="PMMODE__WAITB" />
            <bitfield caption="Parallel Port Mode Select bits" mask="0x00000300" name="MODE" values="PMMODE__MODE" />
            <bitfield caption="8/16-bit Mode bit" mask="0x00000400" name="MODE16" values="PMMODE__MODE16" />
            <bitfield caption="Increment Mode bits" mask="0x00001800" name="INCM" values="PMMODE__INCM" />
            <bitfield caption="Interrupt Request Mode bits" mask="0x00006000" name="IRQM" values="PMMODE__IRQM" />
            <bitfield caption="Busy bit (Master mode only)" mask="0x00008000" name="BUSY" values="PMMODE__BUSY" />
         </register>
         <register caption="Parallel Port Address Register" name="PMADDR" offset="0x20" rw="RW" size="4">
            <bitfield caption="Address bits" mask="0x00003FFF" name="ADDR" values="PMADDR__ADDR" />
            <bitfield mask="0x0000C000" name="CS" />
         </register>
         <register caption="" name="PMDOUT" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATAOUT" />
         </register>
         <register caption="" name="PMDIN" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATAIN" />
         </register>
         <register caption="Parallel Port Pin Enable Register" name="PMAEN" offset="0x50" rw="RW" size="4">
            <bitfield caption="PMALH/PMALL Port Enable bits" mask="0x00000003" name="PTEN" values="PMAEN__PTEN" />
            <bitfield caption="PMP Address Port Enable bits" mask="0x00003ffc" name="PTEN10" values="PMAEN__PTEN2" />
            <bitfield caption="PMCS1 Address Port Enable bit" mask="0x0000c000" name="PTEN14" values="PMAEN__PTEN14" />
         </register>
         <register caption="Parallel Port Status Register (Slave modes only)" name="PMSTAT" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000001" name="OB0E" />
            <bitfield mask="0x00000002" name="OB1E" />
            <bitfield mask="0x00000004" name="OB2E" />
            <bitfield mask="0x00000008" name="OB3E" />
            <bitfield caption="Output Buffer Underflow Status bit" mask="0x00000040" name="OBUF" values="PMSTAT__OBUF" />
            <bitfield caption="Output Buffer Empty Status bit" mask="0x00000080" name="OBE" values="PMSTAT__OBE" />
            <bitfield mask="0x00000100" name="IB0F" />
            <bitfield mask="0x00000200" name="IB1F" />
            <bitfield mask="0x00000400" name="IB2F" />
            <bitfield mask="0x00000800" name="IB3F" />
            <bitfield caption="Input Buffer Overflow Status bit" mask="0x00004000" name="IBOV" values="PMSTAT__IBOV" />
            <bitfield caption="Input Buffer Full Status bit" mask="0x00008000" name="IBF" values="PMSTAT__IBF" />
         </register>
      </register-group>
      <value-group caption="Read Strobe Polarity bit" name="PMCON__RDSP">
         <value caption="(If MODE(1:0) = 00/01/10) Read Strobe active-high / (If MODE(1:0) = 11) Read/write strobe active-high" name="" value="0x1" />
         <value caption="(If MODE(1:0) = 00/01/10) Read Strobe active-low / (If MODE(1:0) = 11) Read/write strobe active-low" name="" value="0x0" />
      </value-group>
