MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX350F128H.atdf
         <register caption="Alarm Date Value Register" name="ALRMDATE" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="WDAY01" />
            <bitfield mask="0x00000F00" name="DAY01" />
            <bitfield mask="0x0000F000" name="DAY10" />
            <bitfield mask="0x000F0000" name="MONTH01" />
            <bitfield mask="0x00F00000" name="MONTH10" />
         </register>
      </register-group>
      <value-group caption="RTCC Output Enable bit" name="RTCCON__RTCOE">
         <value caption="RTCC clock output is enabled clock presented onto an I/O" name="" value="0x1" />
         <value caption="RTCC clock output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Half-Second Status bit" name="RTCCON__HALFSEC">
         <value caption="Second half period of a second" name="" value="0x1" />
         <value caption="First half period of a second" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Value Registers Read Synchronization bit" name="RTCCON__RTCSYNC">
         <value caption="RTC Value registers can change while reading due to a rollover ripple that results in an invalid data read" name="" value="0x1" />
         <value caption="RTC Value registers can be read without concern about a rollover ripple" name="" value="0x0" />
      </value-group>
      <value-group caption="RTC Value Registers Write Enable bit" name="RTCCON__RTCWREN">
         <value caption="RTC Value registers can be written to by the user" name="" value="0x1" />
         <value caption="RTC Value registers are locked out from being written to by the user" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Clock Enable Status bit" name="RTCCON__RTCCLKON">
         <value caption="RTCC Clock is actively running" name="" value="0x1" />
         <value caption="RTCC Clock is not running" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Seconds Clock Output Select bit" name="RTCCON__RTSECSEL">
         <value caption="RTCC Seconds Clock is selected for the RTCC pin" name="" value="0x1" />
         <value caption="RTCC Alarm Pulse is selected for the RTCC pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="RTCCON__SIDL">
         <value caption="Disables the PBCLK to the RTCC when CPU enters in Idle mode" name="" value="0x1" />
         <value caption="Continue normal operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC On bit" name="RTCCON__ON">
         <value caption="RTCC module is enabled" name="" value="0x1" />
         <value caption="RTCC module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="RTC Drift Calibration bits" name="RTCCON__CAL">
         <value caption="Maximum positive adjustment" name="" value="0x1ff" />
         <value caption="Minimum positive adjustment" name="" value="0x1" />
         <value caption="No adjustment" name="" value="0x0" />
         <value caption="Minimum negative adjustment" name="" value="0x3ff" />
         <value caption="Maximum negative adjustment" name="" value="0x200" />
      </value-group>
      <value-group caption="Alarm Repeat Counter Value bits" name="RTCALRM__ARPT">
         <value caption="Alarm will trigger 256 times" name="" value="0xff" />
         <value caption="Alarm will trigger 255 times" name="" value="0xfe" />
         <value caption="Alarm will trigger 254 times" name="" value="0xfd" />
         <value caption="Alarm will trigger 253 times" name="" value="0xfc" />
         <value caption="Alarm will trigger 252 times" name="" value="0xfb" />
         <value caption="Alarm will trigger 251 times" name="" value="0xfa" />
         <value caption="Alarm will trigger 250 times" name="" value="0xf9" />
         <value caption="Alarm will trigger 249 times" name="" value="0xf8" />
         <value caption="Alarm will trigger 248 times" name="" value="0xf7" />
         <value caption="Alarm will trigger 247 times" name="" value="0xf6" />
         <value caption="Alarm will trigger 246 times" name="" value="0xf5" />
         <value caption="Alarm will trigger 245 times" name="" value="0xf4" />
         <value caption="Alarm will trigger 244 times" name="" value="0xf3" />
         <value caption="Alarm will trigger 243 times" name="" value="0xf2" />
         <value caption="Alarm will trigger 242 times" name="" value="0xf1" />
         <value caption="Alarm will trigger 241 times" name="" value="0xf0" />
         <value caption="Alarm will trigger 240 times" name="" value="0xef" />
         <value caption="Alarm will trigger 239 times" name="" value="0xee" />
         <value caption="Alarm will trigger 238 times" name="" value="0xed" />
         <value caption="Alarm will trigger 237 times" name="" value="0xec" />
         <value caption="Alarm will trigger 236 times" name="" value="0xeb" />
         <value caption="Alarm will trigger 235 times" name="" value="0xea" />
         <value caption="Alarm will trigger 234 times" name="" value="0xe9" />
         <value caption="Alarm will trigger 233 times" name="" value="0xe8" />
         <value caption="Alarm will trigger 232 times" name="" value="0xe7" />
         <value caption="Alarm will trigger 231 times" name="" value="0xe6" />
         <value caption="Alarm will trigger 230 times" name="" value="0xe5" />
         <value caption="Alarm will trigger 229 times" name="" value="0xe4" />
         <value caption="Alarm will trigger 228 times" name="" value="0xe3" />
         <value caption="Alarm will trigger 227 times" name="" value="0xe2" />
         <value caption="Alarm will trigger 226 times" name="" value="0xe1" />
         <value caption="Alarm will trigger 225 times" name="" value="0xe0" />
         <value caption="Alarm will trigger 224 times" name="" value="0xdf" />
         <value caption="Alarm will trigger 223 times" name="" value="0xde" />
         <value caption="Alarm will trigger 222 times" name="" value="0xdd" />
         <value caption="Alarm will trigger 221 times" name="" value="0xdc" />
         <value caption="Alarm will trigger 220 times" name="" value="0xdb" />
         <value caption="Alarm will trigger 219 times" name="" value="0xda" />
         <value caption="Alarm will trigger 218 times" name="" value="0xd9" />
         <value caption="Alarm will trigger 217 times" name="" value="0xd8" />
         <value caption="Alarm will trigger 216 times" name="" value="0xd7" />
         <value caption="Alarm will trigger 215 times" name="" value="0xd6" />
         <value caption="Alarm will trigger 214 times" name="" value="0xd5" />
         <value caption="Alarm will trigger 213 times" name="" value="0xd4" />
         <value caption="Alarm will trigger 212 times" name="" value="0xd3" />
         <value caption="Alarm will trigger 211 times" name="" value="0xd2" />
         <value caption="Alarm will trigger 210 times" name="" value="0xd1" />
         <value caption="Alarm will trigger 209 times" name="" value="0xd0" />
         <value caption="Alarm will trigger 208 times" name="" value="0xcf" />
         <value caption="Alarm will trigger 207 times" name="" value="0xce" />
         <value caption="Alarm will trigger 206 times" name="" value="0xcd" />
         <value caption="Alarm will trigger 205 times" name="" value="0xcc" />
         <value caption="Alarm will trigger 204 times" name="" value="0xcb" />
         <value caption="Alarm will trigger 203 times" name="" value="0xca" />
         <value caption="Alarm will trigger 202 times" name="" value="0xc9" />
         <value caption="Alarm will trigger 201 times" name="" value="0xc8" />
         <value caption="Alarm will trigger 200 times" name="" value="0xc7" />
         <value caption="Alarm will trigger 199 times" name="" value="0xc6" />
         <value caption="Alarm will trigger 198 times" name="" value="0xc5" />
         <value caption="Alarm will trigger 197 times" name="" value="0xc4" />
         <value caption="Alarm will trigger 196 times" name="" value="0xc3" />
         <value caption="Alarm will trigger 195 times" name="" value="0xc2" />
         <value caption="Alarm will trigger 194 times" name="" value="0xc1" />
         <value caption="Alarm will trigger 193 times" name="" value="0xc0" />
         <value caption="Alarm will trigger 192 times" name="" value="0xbf" />
         <value caption="Alarm will trigger 191 times" name="" value="0xbe" />
         <value caption="Alarm will trigger 190 times" name="" value="0xbd" />
         <value caption="Alarm will trigger 189 times" name="" value="0xbc" />
         <value caption="Alarm will trigger 188 times" name="" value="0xbb" />
         <value caption="Alarm will trigger 187 times" name="" value="0xba" />
         <value caption="Alarm will trigger 186 times" name="" value="0xb9" />
         <value caption="Alarm will trigger 185 times" name="" value="0xb8" />
         <value caption="Alarm will trigger 184 times" name="" value="0xb7" />
         <value caption="Alarm will trigger 183 times" name="" value="0xb6" />
         <value caption="Alarm will trigger 182 times" name="" value="0xb5" />
         <value caption="Alarm will trigger 181 times" name="" value="0xb4" />
         <value caption="Alarm will trigger 180 times" name="" value="0xb3" />
         <value caption="Alarm will trigger 179 times" name="" value="0xb2" />
         <value caption="Alarm will trigger 178 times" name="" value="0xb1" />
         <value caption="Alarm will trigger 177 times" name="" value="0xb0" />
         <value caption="Alarm will trigger 176 times" name="" value="0xaf" />
         <value caption="Alarm will trigger 175 times" name="" value="0xae" />
         <value caption="Alarm will trigger 174 times" name="" value="0xad" />
         <value caption="Alarm will trigger 173 times" name="" value="0xac" />
         <value caption="Alarm will trigger 172 times" name="" value="0xab" />
         <value caption="Alarm will trigger 171 times" name="" value="0xaa" />
         <value caption="Alarm will trigger 170 times" name="" value="0xa9" />
         <value caption="Alarm will trigger 169 times" name="" value="0xa8" />
         <value caption="Alarm will trigger 168 times" name="" value="0xa7" />
         <value caption="Alarm will trigger 167 times" name="" value="0xa6" />
         <value caption="Alarm will trigger 166 times" name="" value="0xa5" />
         <value caption="Alarm will trigger 165 times" name="" value="0xa4" />
         <value caption="Alarm will trigger 164 times" name="" value="0xa3" />
         <value caption="Alarm will trigger 163 times" name="" value="0xa2" />
         <value caption="Alarm will trigger 162 times" name="" value="0xa1" />
         <value caption="Alarm will trigger 161 times" name="" value="0xa0" />
         <value caption="Alarm will trigger 160 times" name="" value="0x9f" />
         <value caption="Alarm will trigger 159 times" name="" value="0x9e" />
         <value caption="Alarm will trigger 158 times" name="" value="0x9d" />
         <value caption="Alarm will trigger 157 times" name="" value="0x9c" />
         <value caption="Alarm will trigger 156 times" name="" value="0x9b" />
         <value caption="Alarm will trigger 155 times" name="" value="0x9a" />
         <value caption="Alarm will trigger 154 times" name="" value="0x99" />
         <value caption="Alarm will trigger 153 times" name="" value="0x98" />
         <value caption="Alarm will trigger 152 times" name="" value="0x97" />
         <value caption="Alarm will trigger 151 times" name="" value="0x96" />
         <value caption="Alarm will trigger 150 times" name="" value="0x95" />
         <value caption="Alarm will trigger 149 times" name="" value="0x94" />
         <value caption="Alarm will trigger 148 times" name="" value="0x93" />
         <value caption="Alarm will trigger 147 times" name="" value="0x92" />
         <value caption="Alarm will trigger 146 times" name="" value="0x91" />
         <value caption="Alarm will trigger 145 times" name="" value="0x90" />
         <value caption="Alarm will trigger 144 times" name="" value="0x8f" />
         <value caption="Alarm will trigger 143 times" name="" value="0x8e" />
         <value caption="Alarm will trigger 142 times" name="" value="0x8d" />
         <value caption="Alarm will trigger 141 times" name="" value="0x8c" />
         <value caption="Alarm will trigger 140 times" name="" value="0x8b" />
         <value caption="Alarm will trigger 139 times" name="" value="0x8a" />
         <value caption="Alarm will trigger 138 times" name="" value="0x89" />
         <value caption="Alarm will trigger 137 times" name="" value="0x88" />
         <value caption="Alarm will trigger 136 times" name="" value="0x87" />
         <value caption="Alarm will trigger 135 times" name="" value="0x86" />
         <value caption="Alarm will trigger 134 times" name="" value="0x85" />
         <value caption="Alarm will trigger 133 times" name="" value="0x84" />
         <value caption="Alarm will trigger 132 times" name="" value="0x83" />
         <value caption="Alarm will trigger 131 times" name="" value="0x82" />
         <value caption="Alarm will trigger 130 times" name="" value="0x81" />
         <value caption="Alarm will trigger 129 times" name="" value="0x80" />
         <value caption="Alarm will trigger 128 times" name="" value="0x7f" />
         <value caption="Alarm will trigger 127 times" name="" value="0x7e" />
         <value caption="Alarm will trigger 126 times" name="" value="0x7d" />
         <value caption="Alarm will trigger 125 times" name="" value="0x7c" />
         <value caption="Alarm will trigger 124 times" name="" value="0x7b" />
         <value caption="Alarm will trigger 123 times" name="" value="0x7a" />
         <value caption="Alarm will trigger 122 times" name="" value="0x79" />
         <value caption="Alarm will trigger 121 times" name="" value="0x78" />
         <value caption="Alarm will trigger 120 times" name="" value="0x77" />
         <value caption="Alarm will trigger 119 times" name="" value="0x76" />
         <value caption="Alarm will trigger 118 times" name="" value="0x75" />
         <value caption="Alarm will trigger 117 times" name="" value="0x74" />
         <value caption="Alarm will trigger 116 times" name="" value="0x73" />
         <value caption="Alarm will trigger 115 times" name="" value="0x72" />
         <value caption="Alarm will trigger 114 times" name="" value="0x71" />
         <value caption="Alarm will trigger 113 times" name="" value="0x70" />
         <value caption="Alarm will trigger 112 times" name="" value="0x6f" />
         <value caption="Alarm will trigger 111 times" name="" value="0x6e" />
         <value caption="Alarm will trigger 110 times" name="" value="0x6d" />
         <value caption="Alarm will trigger 109 times" name="" value="0x6c" />
         <value caption="Alarm will trigger 108 times" name="" value="0x6b" />
         <value caption="Alarm will trigger 107 times" name="" value="0x6a" />
         <value caption="Alarm will trigger 106 times" name="" value="0x69" />
         <value caption="Alarm will trigger 105 times" name="" value="0x68" />
         <value caption="Alarm will trigger 104 times" name="" value="0x67" />
         <value caption="Alarm will trigger 103 times" name="" value="0x66" />
         <value caption="Alarm will trigger 102 times" name="" value="0x65" />
         <value caption="Alarm will trigger 101 times" name="" value="0x64" />
         <value caption="Alarm will trigger 100 times" name="" value="0x63" />
         <value caption="Alarm will trigger 99 times" name="" value="0x62" />
         <value caption="Alarm will trigger 98 times" name="" value="0x61" />
         <value caption="Alarm will trigger 97 times" name="" value="0x60" />
         <value caption="Alarm will trigger 96 times" name="" value="0x5f" />
         <value caption="Alarm will trigger 95 times" name="" value="0x5e" />
         <value caption="Alarm will trigger 94 times" name="" value="0x5d" />
         <value caption="Alarm will trigger 93 times" name="" value="0x5c" />
         <value caption="Alarm will trigger 92 times" name="" value="0x5b" />
         <value caption="Alarm will trigger 91 times" name="" value="0x5a" />
         <value caption="Alarm will trigger 90 times" name="" value="0x59" />
         <value caption="Alarm will trigger 89 times" name="" value="0x58" />
         <value caption="Alarm will trigger 88 times" name="" value="0x57" />
         <value caption="Alarm will trigger 87 times" name="" value="0x56" />
         <value caption="Alarm will trigger 86 times" name="" value="0x55" />
         <value caption="Alarm will trigger 85 times" name="" value="0x54" />
         <value caption="Alarm will trigger 84 times" name="" value="0x53" />
         <value caption="Alarm will trigger 83 times" name="" value="0x52" />
         <value caption="Alarm will trigger 82 times" name="" value="0x51" />
         <value caption="Alarm will trigger 81 times" name="" value="0x50" />
         <value caption="Alarm will trigger 80 times" name="" value="0x4f" />
         <value caption="Alarm will trigger 79 times" name="" value="0x4e" />
         <value caption="Alarm will trigger 78 times" name="" value="0x4d" />
         <value caption="Alarm will trigger 77 times" name="" value="0x4c" />
         <value caption="Alarm will trigger 76 times" name="" value="0x4b" />
         <value caption="Alarm will trigger 75 times" name="" value="0x4a" />
         <value caption="Alarm will trigger 74 times" name="" value="0x49" />
         <value caption="Alarm will trigger 73 times" name="" value="0x48" />
         <value caption="Alarm will trigger 72 times" name="" value="0x47" />
         <value caption="Alarm will trigger 71 times" name="" value="0x46" />
         <value caption="Alarm will trigger 70 times" name="" value="0x45" />
         <value caption="Alarm will trigger 69 times" name="" value="0x44" />
         <value caption="Alarm will trigger 68 times" name="" value="0x43" />
         <value caption="Alarm will trigger 67 times" name="" value="0x42" />
         <value caption="Alarm will trigger 66 times" name="" value="0x41" />
         <value caption="Alarm will trigger 65 times" name="" value="0x40" />
         <value caption="Alarm will trigger 64 times" name="" value="0x3f" />
         <value caption="Alarm will trigger 63 times" name="" value="0x3e" />
         <value caption="Alarm will trigger 62 times" name="" value="0x3d" />
         <value caption="Alarm will trigger 61 times" name="" value="0x3c" />
         <value caption="Alarm will trigger 60 times" name="" value="0x3b" />
         <value caption="Alarm will trigger 59 times" name="" value="0x3a" />
         <value caption="Alarm will trigger 58 times" name="" value="0x39" />
         <value caption="Alarm will trigger 57 times" name="" value="0x38" />
         <value caption="Alarm will trigger 56 times" name="" value="0x37" />
         <value caption="Alarm will trigger 55 times" name="" value="0x36" />
         <value caption="Alarm will trigger 54 times" name="" value="0x35" />
         <value caption="Alarm will trigger 53 times" name="" value="0x34" />
         <value caption="Alarm will trigger 52 times" name="" value="0x33" />
         <value caption="Alarm will trigger 51 times" name="" value="0x32" />
         <value caption="Alarm will trigger 50 times" name="" value="0x31" />
         <value caption="Alarm will trigger 49 times" name="" value="0x30" />
         <value caption="Alarm will trigger 48 times" name="" value="0x2f" />
         <value caption="Alarm will trigger 47 times" name="" value="0x2e" />
         <value caption="Alarm will trigger 46 times" name="" value="0x2d" />
         <value caption="Alarm will trigger 45 times" name="" value="0x2c" />
         <value caption="Alarm will trigger 44 times" name="" value="0x2b" />
         <value caption="Alarm will trigger 43 times" name="" value="0x2a" />
         <value caption="Alarm will trigger 42 times" name="" value="0x29" />
         <value caption="Alarm will trigger 41 times" name="" value="0x28" />
         <value caption="Alarm will trigger 40 times" name="" value="0x27" />
         <value caption="Alarm will trigger 39 times" name="" value="0x26" />
         <value caption="Alarm will trigger 38 times" name="" value="0x25" />
         <value caption="Alarm will trigger 37 times" name="" value="0x24" />
         <value caption="Alarm will trigger 36 times" name="" value="0x23" />
         <value caption="Alarm will trigger 35 times" name="" value="0x22" />
         <value caption="Alarm will trigger 34 times" name="" value="0x21" />
         <value caption="Alarm will trigger 33 times" name="" value="0x20" />
         <value caption="Alarm will trigger 32 times" name="" value="0x1f" />
         <value caption="Alarm will trigger 31 times" name="" value="0x1e" />
         <value caption="Alarm will trigger 30 times" name="" value="0x1d" />
         <value caption="Alarm will trigger 29 times" name="" value="0x1c" />
         <value caption="Alarm will trigger 28 times" name="" value="0x1b" />
         <value caption="Alarm will trigger 27 times" name="" value="0x1a" />
         <value caption="Alarm will trigger 26 times" name="" value="0x19" />
         <value caption="Alarm will trigger 25 times" name="" value="0x18" />
         <value caption="Alarm will trigger 24 times" name="" value="0x17" />
         <value caption="Alarm will trigger 23 times" name="" value="0x16" />
         <value caption="Alarm will trigger 22 times" name="" value="0x15" />
         <value caption="Alarm will trigger 21 times" name="" value="0x14" />
         <value caption="Alarm will trigger 20 times" name="" value="0x13" />
         <value caption="Alarm will trigger 19 times" name="" value="0x12" />
         <value caption="Alarm will trigger 18 times" name="" value="0x11" />
         <value caption="Alarm will trigger 17 times" name="" value="0x10" />
         <value caption="Alarm will trigger 16 times" name="" value="0xf" />
         <value caption="Alarm will trigger 15 times" name="" value="0xe" />
         <value caption="Alarm will trigger 14 times" name="" value="0xd" />
         <value caption="Alarm will trigger 13 times" name="" value="0xc" />
         <value caption="Alarm will trigger 12 times" name="" value="0xb" />
         <value caption="Alarm will trigger 11 times" name="" value="0xa" />
         <value caption="Alarm will trigger 10 times" name="" value="0x9" />
         <value caption="Alarm will trigger 9 times" name="" value="0x8" />
         <value caption="Alarm will trigger 8 times" name="" value="0x7" />
         <value caption="Alarm will trigger 7 times" name="" value="0x6" />
         <value caption="Alarm will trigger 6 times" name="" value="0x5" />
         <value caption="Alarm will trigger 5 times" name="" value="0x4" />
         <value caption="Alarm will trigger 4 times" name="" value="0x3" />
         <value caption="Alarm will trigger 3 times" name="" value="0x2" />
         <value caption="Alarm will trigger 2 times" name="" value="0x1" />
         <value caption="Alarm will trigger 1 times" name="" value="0x0" />
      </value-group>
